Tekla.Structures.Drawing.TextFile
The TextFile class defines a text file object in a drawing.
The following example shows how to insert a text file object:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System.IO;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
ViewBase _sheet = MyDrawingHandler.GetActiveDrawing().GetSheet();
TextFile text = new TextFile(_sheet, new Point(-300, 100), Path.GetFullPath("my_text.txt"));
text.Insert();
}
}
The following code inserts an object whose height is forced to 400 and width to 500, but
it can overflow if the text is too long.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System.IO;
public class Example
{
public void Example1()
{
Drawing myDrawing = new GADrawing();
TextFile text = new TextFile(myDrawing.GetSheet(), new Point(-300, 100),
Path.GetFullPath("my_text.txt"), new Size(500, 400));
text.Insert();
}
}
Remarks:
A text file object can be inserted as-is without scaling or it can be forced
to fit inside the given space. The content is scaled in the Y direction, but it can overflow
in the X direction.

Tekla.Structures.Drawing.TextFile.Attributes
Gets or sets the text file attributes.

Tekla.Structures.Drawing.TextFile.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Drawing.Size)
Creates a new text file instance using standard attributes.
view: The view for the object.
insertionPoint: The location of the object.
fileName: The name of the referenced text file.
size: The maximum height of the text file object.

Tekla.Structures.Drawing.TextFile.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Drawing.Size,Tekla.Structures.Drawing.TextFile.TextFileAttributes)
Creates a new text file instance using specific attributes.
view: The view for the object.
insertionPoint: The location of the object.
fileName: The name of the referenced text file.
size: The maximum height of the text file object.
attributes: The text file attributes to be used.

Tekla.Structures.Drawing.TextFile.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String)
Creates a new text file instance using standard attributes.
view: The view for the object.
insertionPoint: The location of the object.
fileName: The name of the referenced text file.

Tekla.Structures.Drawing.TextFile.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Drawing.TextFile.TextFileAttributes)
Creates a new text file instance using specific attributes.
view: The view for the object.
insertionPoint: The location of the object.
fileName: The name of the referenced text file.
attributes: The text file attributes to be used.

Tekla.Structures.Drawing.TextFile.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.TextFile.Insert
Inserts the text file object.
Returns: True if succeeded.

Tekla.Structures.Drawing.TextFile.Select
Selects the text file object.
Returns: True if succeeded.

Tekla.Structures.Drawing.TextFile.Modify
Modifies the text file object.
Returns: True if succeeded.

Tekla.Structures.Drawing.TextFile.Delete
Deletes the text file object.
Returns: True if succeeded.